#include "iostream"

using namespace std;

/*
 * for (循环因子初始化语句①; 条件语句②; 循环因子更新语句④) 
 * {
 *    // 循环体③，当条件表达式为真时执行
 *      code;
 *      ...
 *      ...
 * } 
 */

int main() {
    // 基础for循环，打印1-10的数字
    for (int i = 1; i <= 10; i++) {
        cout << i << "\t";
    }

    // 打印1-20之间的奇数
    for (int i = 1; i <= 20; i += 2) {
        cout << i << "\t";
    }

    // 求1-100之间的偶数和
    int sum = 0;
    for (int i = 2; i<= 100; i += 2) {
        sum += i;
    }
    cout << "1-100之间的偶数和为：" << sum << endl;

    
    //  for循环()内的三个部分，可以按照需求省略
    // 条件判断可以省略
    // for (int i = 1; ; i++) {
    //     cout << i << "\t";
    // }

    // 循环控制因子的创建可以省略
    // 尽管可以省略，但是一般离不开循环控制因子，所以尽量别省略
    // int i = 1;
    // for (; i <= 100; i++) {
    //     cout << i << "\t";
    // }

    // 循环控制因子的更新语句也可以省略
    // for (int i = 0; i <= 10;) {
    //     cout << i << "\t";
    //     i++;
    // }

    return 0;
}