#include "iostream"

using namespace std;

/*
 * 一维数组：
 *      数据类型 数组名[n];
 * 二维数组：
 *      数据类型 数组名[m][n];
 * 三维数组：
 *      数据类型 数组名[m][n][o];
 * 多维数组：
 *     数据类型 数组名[x][y][z]...[n];
 */

int main() {
    int arr1[2][2];
    arr1[0][0] = 11;
    arr1[0][1] = 22;
    arr1[1][0] = 33;
    arr1[1][1] = 44;

    int arr2[2][2] = {{11, 22},{33, 44}};

    cout << "arr1数组的第二个元素内的第一个元素是：" << arr1[1][0] << endl;
    cout << "arr2数组的第一个元素内的第二个元素是：" << arr2[0][1] << endl;

    int arr3[2][2][2];
    arr3[0][0][0] = 1;
    arr3[0][0][1] = 2;
    arr3[0][1][0] = 3;
    arr3[0][1][1] = 4;
    arr3[1][0][0] = 5;
    arr3[1][0][1] = 6;
    arr3[1][1][0] = 7;
    arr3[1][1][1] = 8;

    int arr4[2][2][2] = {
        {
            {1, 2}, {3, 4}
        },
        {
            {5, 6}, {7, 8}
        }
    };

    cout << "三维数组v3的第二个元素的第二个元素内的第一个元素是：" << arr3[1][1][0] << endl;
    cout << "三维数组v4的第一个元素的第一个元素内的第二个元素是：" << arr4[0][0][1] << endl;

    return 0;
} 